grevaillot/svd_tools/headers/ATSAMV71J20/pwm0.h
#pragma once 

/* --- PWM0: Pulse Width Modulation Controller ---------------------- */

/** @defgroup pwm0_registers Pulse Width Modulation Controller Register
@{*/

/** PWM0_PWM_CLK PWM Clock Register **/
#define PWM0_PWM_CLK			MMIO32(PWM0_BASE + 0x00)
/** PWM0_PWM_ENA PWM Enable Register **/
#define PWM0_PWM_ENA			MMIO32(PWM0_BASE + 0x04)
/** PWM0_PWM_DIS PWM Disable Register **/
#define PWM0_PWM_DIS			MMIO32(PWM0_BASE + 0x08)
/** PWM0_PWM_SR PWM Status Register **/
#define PWM0_PWM_SR			MMIO32(PWM0_BASE + 0x0c)
/** PWM0_PWM_IER1 PWM Interrupt Enable Register 1 **/
#define PWM0_PWM_IER1			MMIO32(PWM0_BASE + 0x10)
/** PWM0_PWM_IDR1 PWM Interrupt Disable Register 1 **/
#define PWM0_PWM_IDR1			MMIO32(PWM0_BASE + 0x14)
/** PWM0_PWM_IMR1 PWM Interrupt Mask Register 1 **/
#define PWM0_PWM_IMR1			MMIO32(PWM0_BASE + 0x18)
/** PWM0_PWM_ISR1 PWM Interrupt Status Register 1 **/
#define PWM0_PWM_ISR1			MMIO32(PWM0_BASE + 0x1c)
/** PWM0_PWM_SCM PWM Sync Channels Mode Register **/
#define PWM0_PWM_SCM			MMIO32(PWM0_BASE + 0x20)
/** PWM0_PWM_DMAR PWM DMA Register **/
#define PWM0_PWM_DMAR			MMIO32(PWM0_BASE + 0x24)
/** PWM0_PWM_SCUC PWM Sync Channels Update Control Register **/
#define PWM0_PWM_SCUC			MMIO32(PWM0_BASE + 0x28)
/** PWM0_PWM_SCUP PWM Sync Channels Update Period Register **/
#define PWM0_PWM_SCUP			MMIO32(PWM0_BASE + 0x2c)
/** PWM0_PWM_SCUPUPD PWM Sync Channels Update Period Update Register **/
#define PWM0_PWM_SCUPUPD			MMIO32(PWM0_BASE + 0x30)
/** PWM0_PWM_IER2 PWM Interrupt Enable Register 2 **/
#define PWM0_PWM_IER2			MMIO32(PWM0_BASE + 0x34)
/** PWM0_PWM_IDR2 PWM Interrupt Disable Register 2 **/
#define PWM0_PWM_IDR2			MMIO32(PWM0_BASE + 0x38)
/** PWM0_PWM_IMR2 PWM Interrupt Mask Register 2 **/
#define PWM0_PWM_IMR2			MMIO32(PWM0_BASE + 0x3c)
/** PWM0_PWM_ISR2 PWM Interrupt Status Register 2 **/
#define PWM0_PWM_ISR2			MMIO32(PWM0_BASE + 0x40)
/** PWM0_PWM_OOV PWM Output Override Value Register **/
#define PWM0_PWM_OOV			MMIO32(PWM0_BASE + 0x44)
/** PWM0_PWM_OS PWM Output Selection Register **/
#define PWM0_PWM_OS			MMIO32(PWM0_BASE + 0x48)
/** PWM0_PWM_OSS PWM Output Selection Set Register **/
#define PWM0_PWM_OSS			MMIO32(PWM0_BASE + 0x4c)
/** PWM0_PWM_OSC PWM Output Selection Clear Register **/
#define PWM0_PWM_OSC			MMIO32(PWM0_BASE + 0x50)
/** PWM0_PWM_OSSUPD PWM Output Selection Set Update Register **/
#define PWM0_PWM_OSSUPD			MMIO32(PWM0_BASE + 0x54)
/** PWM0_PWM_OSCUPD PWM Output Selection Clear Update Register **/
#define PWM0_PWM_OSCUPD			MMIO32(PWM0_BASE + 0x58)
/** PWM0_PWM_FMR PWM Fault Mode Register **/
#define PWM0_PWM_FMR			MMIO32(PWM0_BASE + 0x5c)
/** PWM0_PWM_FSR PWM Fault Status Register **/
#define PWM0_PWM_FSR			MMIO32(PWM0_BASE + 0x60)
/** PWM0_PWM_FCR PWM Fault Clear Register **/
#define PWM0_PWM_FCR			MMIO32(PWM0_BASE + 0x64)
/** PWM0_PWM_FPV1 PWM Fault Protection Value Register 1 **/
#define PWM0_PWM_FPV1			MMIO32(PWM0_BASE + 0x68)
/** PWM0_PWM_FPE PWM Fault Protection Enable Register **/
#define PWM0_PWM_FPE			MMIO32(PWM0_BASE + 0x6c)
/** PWM0_PWM_ELMR[0] PWM Event Line 0 Mode Register 0 **/
#define PWM0_PWM_ELMR[0]			MMIO32(PWM0_BASE + 0x7c)
/** PWM0_PWM_ELMR[1] PWM Event Line 0 Mode Register 0 **/
#define PWM0_PWM_ELMR[1]			MMIO32(PWM0_BASE + 0x80)
/** PWM0_PWM_SSPR PWM Spread Spectrum Register **/
#define PWM0_PWM_SSPR			MMIO32(PWM0_BASE + 0xa0)
/** PWM0_PWM_SSPUP PWM Spread Spectrum Update Register **/
#define PWM0_PWM_SSPUP			MMIO32(PWM0_BASE + 0xa4)
/** PWM0_PWM_SMMR PWM Stepper Motor Mode Register **/
#define PWM0_PWM_SMMR			MMIO32(PWM0_BASE + 0xb0)
/** PWM0_PWM_FPV2 PWM Fault Protection Value 2 Register **/
#define PWM0_PWM_FPV2			MMIO32(PWM0_BASE + 0xc0)
/** PWM0_PWM_WPCR PWM Write Protection Control Register **/
#define PWM0_PWM_WPCR			MMIO32(PWM0_BASE + 0xe4)
/** PWM0_PWM_WPSR PWM Write Protection Status Register **/
#define PWM0_PWM_WPSR			MMIO32(PWM0_BASE + 0xe8)
/** PWM0_PWM_VERSION Version Register **/
#define PWM0_PWM_VERSION			MMIO32(PWM0_BASE + 0xfc)
/** PWM0_PWM_CMP[0]_PWM_CMPV PWM Comparison 0 Value Register **/
#define PWM0_PWM_CMP[0]_PWM_CMPV			MMIO32(PWM0_BASE + 0x130)
/** PWM0_PWM_CMP[0]_PWM_CMPVUPD PWM Comparison 0 Value Update Register **/
#define PWM0_PWM_CMP[0]_PWM_CMPVUPD			MMIO32(PWM0_BASE + 0x134)
/** PWM0_PWM_CMP[0]_PWM_CMPM PWM Comparison 0 Mode Register **/
#define PWM0_PWM_CMP[0]_PWM_CMPM			MMIO32(PWM0_BASE + 0x138)
/** PWM0_PWM_CMP[0]_PWM_CMPMUPD PWM Comparison 0 Mode Update Register **/
#define PWM0_PWM_CMP[0]_PWM_CMPMUPD			MMIO32(PWM0_BASE + 0x13c)
/** PWM0_PWM_CMP[1]_PWM_CMPV PWM Comparison 0 Value Register **/
#define PWM0_PWM_CMP[1]_PWM_CMPV			MMIO32(PWM0_BASE + 0x140)
/** PWM0_PWM_CMP[1]_PWM_CMPVUPD PWM Comparison 0 Value Update Register **/
#define PWM0_PWM_CMP[1]_PWM_CMPVUPD			MMIO32(PWM0_BASE + 0x144)
/** PWM0_PWM_CMP[1]_PWM_CMPM PWM Comparison 0 Mode Register **/
#define PWM0_PWM_CMP[1]_PWM_CMPM			MMIO32(PWM0_BASE + 0x148)
/** PWM0_PWM_CMP[1]_PWM_CMPMUPD PWM Comparison 0 Mode Update Register **/
#define PWM0_PWM_CMP[1]_PWM_CMPMUPD			MMIO32(PWM0_BASE + 0x14c)
/** PWM0_PWM_CMP[2]_PWM_CMPV PWM Comparison 0 Value Register **/
#define PWM0_PWM_CMP[2]_PWM_CMPV			MMIO32(PWM0_BASE + 0x150)
/** PWM0_PWM_CMP[2]_PWM_CMPVUPD PWM Comparison 0 Value Update Register **/
#define PWM0_PWM_CMP[2]_PWM_CMPVUPD			MMIO32(PWM0_BASE + 0x154)
/** PWM0_PWM_CMP[2]_PWM_CMPM PWM Comparison 0 Mode Register **/
#define PWM0_PWM_CMP[2]_PWM_CMPM			MMIO32(PWM0_BASE + 0x158)
/** PWM0_PWM_CMP[2]_PWM_CMPMUPD PWM Comparison 0 Mode Update Register **/
#define PWM0_PWM_CMP[2]_PWM_CMPMUPD			MMIO32(PWM0_BASE + 0x15c)
/** PWM0_PWM_CMP[3]_PWM_CMPV PWM Comparison 0 Value Register **/
#define PWM0_PWM_CMP[3]_PWM_CMPV			MMIO32(PWM0_BASE + 0x160)
/** PWM0_PWM_CMP[3]_PWM_CMPVUPD PWM Comparison 0 Value Update Register **/
#define PWM0_PWM_CMP[3]_PWM_CMPVUPD			MMIO32(PWM0_BASE + 0x164)
/** PWM0_PWM_CMP[3]_PWM_CMPM PWM Comparison 0 Mode Register **/
#define PWM0_PWM_CMP[3]_PWM_CMPM			MMIO32(PWM0_BASE + 0x168)
/** PWM0_PWM_CMP[3]_PWM_CMPMUPD PWM Comparison 0 Mode Update Register **/
#define PWM0_PWM_CMP[3]_PWM_CMPMUPD			MMIO32(PWM0_BASE + 0x16c)
/** PWM0_PWM_CMP[4]_PWM_CMPV PWM Comparison 0 Value Register **/
#define PWM0_PWM_CMP[4]_PWM_CMPV			MMIO32(PWM0_BASE + 0x170)
/** PWM0_PWM_CMP[4]_PWM_CMPVUPD PWM Comparison 0 Value Update Register **/
#define PWM0_PWM_CMP[4]_PWM_CMPVUPD			MMIO32(PWM0_BASE + 0x174)
/** PWM0_PWM_CMP[4]_PWM_CMPM PWM Comparison 0 Mode Register **/
#define PWM0_PWM_CMP[4]_PWM_CMPM			MMIO32(PWM0_BASE + 0x178)
/** PWM0_PWM_CMP[4]_PWM_CMPMUPD PWM Comparison 0 Mode Update Register **/
#define PWM0_PWM_CMP[4]_PWM_CMPMUPD			MMIO32(PWM0_BASE + 0x17c)
/** PWM0_PWM_CMP[5]_PWM_CMPV PWM Comparison 0 Value Register **/
#define PWM0_PWM_CMP[5]_PWM_CMPV			MMIO32(PWM0_BASE + 0x180)
/** PWM0_PWM_CMP[5]_PWM_CMPVUPD PWM Comparison 0 Value Update Register **/
#define PWM0_PWM_CMP[5]_PWM_CMPVUPD			MMIO32(PWM0_BASE + 0x184)
/** PWM0_PWM_CMP[5]_PWM_CMPM PWM Comparison 0 Mode Register **/
#define PWM0_PWM_CMP[5]_PWM_CMPM			MMIO32(PWM0_BASE + 0x188)
/** PWM0_PWM_CMP[5]_PWM_CMPMUPD PWM Comparison 0 Mode Update Register **/
#define PWM0_PWM_CMP[5]_PWM_CMPMUPD			MMIO32(PWM0_BASE + 0x18c)
/** PWM0_PWM_CMP[6]_PWM_CMPV PWM Comparison 0 Value Register **/
#define PWM0_PWM_CMP[6]_PWM_CMPV			MMIO32(PWM0_BASE + 0x190)
/** PWM0_PWM_CMP[6]_PWM_CMPVUPD PWM Comparison 0 Value Update Register **/
#define PWM0_PWM_CMP[6]_PWM_CMPVUPD			MMIO32(PWM0_BASE + 0x194)
/** PWM0_PWM_CMP[6]_PWM_CMPM PWM Comparison 0 Mode Register **/
#define PWM0_PWM_CMP[6]_PWM_CMPM			MMIO32(PWM0_BASE + 0x198)
/** PWM0_PWM_CMP[6]_PWM_CMPMUPD PWM Comparison 0 Mode Update Register **/
#define PWM0_PWM_CMP[6]_PWM_CMPMUPD			MMIO32(PWM0_BASE + 0x19c)
/** PWM0_PWM_CMP[7]_PWM_CMPV PWM Comparison 0 Value Register **/
#define PWM0_PWM_CMP[7]_PWM_CMPV			MMIO32(PWM0_BASE + 0x1a0)
/** PWM0_PWM_CMP[7]_PWM_CMPVUPD PWM Comparison 0 Value Update Register **/
#define PWM0_PWM_CMP[7]_PWM_CMPVUPD			MMIO32(PWM0_BASE + 0x1a4)
/** PWM0_PWM_CMP[7]_PWM_CMPM PWM Comparison 0 Mode Register **/
#define PWM0_PWM_CMP[7]_PWM_CMPM			MMIO32(PWM0_BASE + 0x1a8)
/** PWM0_PWM_CMP[7]_PWM_CMPMUPD PWM Comparison 0 Mode Update Register **/
#define PWM0_PWM_CMP[7]_PWM_CMPMUPD			MMIO32(PWM0_BASE + 0x1ac)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR PWM Channel Mode Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR			MMIO32(PWM0_BASE + 0x200)
/** PWM0_PWM_CH_NUM[0]_PWM_CDTY PWM Channel Duty Cycle Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[0]_PWM_CDTY			MMIO32(PWM0_BASE + 0x204)
/** PWM0_PWM_CH_NUM[0]_PWM_CDTYUPD PWM Channel Duty Cycle Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[0]_PWM_CDTYUPD			MMIO32(PWM0_BASE + 0x208)
/** PWM0_PWM_CH_NUM[0]_PWM_CPRD PWM Channel Period Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[0]_PWM_CPRD			MMIO32(PWM0_BASE + 0x20c)
/** PWM0_PWM_CH_NUM[0]_PWM_CPRDUPD PWM Channel Period Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[0]_PWM_CPRDUPD			MMIO32(PWM0_BASE + 0x210)
/** PWM0_PWM_CH_NUM[0]_PWM_CCNT PWM Channel Counter Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[0]_PWM_CCNT			MMIO32(PWM0_BASE + 0x214)
/** PWM0_PWM_CH_NUM[0]_PWM_DT PWM Channel Dead Time Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[0]_PWM_DT			MMIO32(PWM0_BASE + 0x218)
/** PWM0_PWM_CH_NUM[0]_PWM_DTUPD PWM Channel Dead Time Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[0]_PWM_DTUPD			MMIO32(PWM0_BASE + 0x21c)
/** PWM0_PWM_CH_NUM[1]_PWM_CMR PWM Channel Mode Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[1]_PWM_CMR			MMIO32(PWM0_BASE + 0x220)
/** PWM0_PWM_CH_NUM[1]_PWM_CDTY PWM Channel Duty Cycle Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[1]_PWM_CDTY			MMIO32(PWM0_BASE + 0x224)
/** PWM0_PWM_CH_NUM[1]_PWM_CDTYUPD PWM Channel Duty Cycle Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[1]_PWM_CDTYUPD			MMIO32(PWM0_BASE + 0x228)
/** PWM0_PWM_CH_NUM[1]_PWM_CPRD PWM Channel Period Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[1]_PWM_CPRD			MMIO32(PWM0_BASE + 0x22c)
/** PWM0_PWM_CH_NUM[1]_PWM_CPRDUPD PWM Channel Period Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[1]_PWM_CPRDUPD			MMIO32(PWM0_BASE + 0x230)
/** PWM0_PWM_CH_NUM[1]_PWM_CCNT PWM Channel Counter Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[1]_PWM_CCNT			MMIO32(PWM0_BASE + 0x234)
/** PWM0_PWM_CH_NUM[1]_PWM_DT PWM Channel Dead Time Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[1]_PWM_DT			MMIO32(PWM0_BASE + 0x238)
/** PWM0_PWM_CH_NUM[1]_PWM_DTUPD PWM Channel Dead Time Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[1]_PWM_DTUPD			MMIO32(PWM0_BASE + 0x23c)
/** PWM0_PWM_CH_NUM[2]_PWM_CMR PWM Channel Mode Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[2]_PWM_CMR			MMIO32(PWM0_BASE + 0x240)
/** PWM0_PWM_CH_NUM[2]_PWM_CDTY PWM Channel Duty Cycle Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[2]_PWM_CDTY			MMIO32(PWM0_BASE + 0x244)
/** PWM0_PWM_CH_NUM[2]_PWM_CDTYUPD PWM Channel Duty Cycle Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[2]_PWM_CDTYUPD			MMIO32(PWM0_BASE + 0x248)
/** PWM0_PWM_CH_NUM[2]_PWM_CPRD PWM Channel Period Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[2]_PWM_CPRD			MMIO32(PWM0_BASE + 0x24c)
/** PWM0_PWM_CH_NUM[2]_PWM_CPRDUPD PWM Channel Period Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[2]_PWM_CPRDUPD			MMIO32(PWM0_BASE + 0x250)
/** PWM0_PWM_CH_NUM[2]_PWM_CCNT PWM Channel Counter Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[2]_PWM_CCNT			MMIO32(PWM0_BASE + 0x254)
/** PWM0_PWM_CH_NUM[2]_PWM_DT PWM Channel Dead Time Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[2]_PWM_DT			MMIO32(PWM0_BASE + 0x258)
/** PWM0_PWM_CH_NUM[2]_PWM_DTUPD PWM Channel Dead Time Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[2]_PWM_DTUPD			MMIO32(PWM0_BASE + 0x25c)
/** PWM0_PWM_CH_NUM[3]_PWM_CMR PWM Channel Mode Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[3]_PWM_CMR			MMIO32(PWM0_BASE + 0x260)
/** PWM0_PWM_CH_NUM[3]_PWM_CDTY PWM Channel Duty Cycle Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[3]_PWM_CDTY			MMIO32(PWM0_BASE + 0x264)
/** PWM0_PWM_CH_NUM[3]_PWM_CDTYUPD PWM Channel Duty Cycle Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[3]_PWM_CDTYUPD			MMIO32(PWM0_BASE + 0x268)
/** PWM0_PWM_CH_NUM[3]_PWM_CPRD PWM Channel Period Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[3]_PWM_CPRD			MMIO32(PWM0_BASE + 0x26c)
/** PWM0_PWM_CH_NUM[3]_PWM_CPRDUPD PWM Channel Period Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[3]_PWM_CPRDUPD			MMIO32(PWM0_BASE + 0x270)
/** PWM0_PWM_CH_NUM[3]_PWM_CCNT PWM Channel Counter Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[3]_PWM_CCNT			MMIO32(PWM0_BASE + 0x274)
/** PWM0_PWM_CH_NUM[3]_PWM_DT PWM Channel Dead Time Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[3]_PWM_DT			MMIO32(PWM0_BASE + 0x278)
/** PWM0_PWM_CH_NUM[3]_PWM_DTUPD PWM Channel Dead Time Update Register (ch_num = 0) **/
#define PWM0_PWM_CH_NUM[3]_PWM_DTUPD			MMIO32(PWM0_BASE + 0x27c)
/** PWM0_PWM_CMUPD0 PWM Channel Mode Update Register (ch_num = 0) **/
#define PWM0_PWM_CMUPD0			MMIO32(PWM0_BASE + 0x400)
/** PWM0_PWM_CMUPD1 PWM Channel Mode Update Register (ch_num = 1) **/
#define PWM0_PWM_CMUPD1			MMIO32(PWM0_BASE + 0x420)
/** PWM0_PWM_ETRG1 PWM External Trigger Register (trg_num = 1) **/
#define PWM0_PWM_ETRG1			MMIO32(PWM0_BASE + 0x42c)
/** PWM0_PWM_LEBR1 PWM Leading-Edge Blanking Register (trg_num = 1) **/
#define PWM0_PWM_LEBR1			MMIO32(PWM0_BASE + 0x430)
/** PWM0_PWM_CMUPD2 PWM Channel Mode Update Register (ch_num = 2) **/
#define PWM0_PWM_CMUPD2			MMIO32(PWM0_BASE + 0x440)
/** PWM0_PWM_ETRG2 PWM External Trigger Register (trg_num = 2) **/
#define PWM0_PWM_ETRG2			MMIO32(PWM0_BASE + 0x44c)
/** PWM0_PWM_LEBR2 PWM Leading-Edge Blanking Register (trg_num = 2) **/
#define PWM0_PWM_LEBR2			MMIO32(PWM0_BASE + 0x450)
/** PWM0_PWM_CMUPD3 PWM Channel Mode Update Register (ch_num = 3) **/
#define PWM0_PWM_CMUPD3			MMIO32(PWM0_BASE + 0x460)

/**@}*/


/** @defgroup pwm0_pwm_clk PWMCLK PWM Clock Register
@{*/


