grevaillot/svd_tools/headers/ATSAMV71J20/pwm0.h
#define PWM0_PWM_CMP[6]_PWM_CMPM_CPR_SHIFT		8
#define PWM0_PWM_CMP[6]_PWM_CMPM_CPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[6]_pwm_cmpm_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[6]_PWM_CMPM_CTR_SHIFT		4
#define PWM0_PWM_CMP[6]_PWM_CMPM_CTR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[6]_pwm_cmpm_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM0_PWM_CMP[6]_PWM_CMPM_CEN Comparison x Enable **/
#define PWM0_PWM_CMP[6]_PWM_CMPM_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[6]_pwm_cmpmupd PWMCMP[6]PWMCMPMUPD PWM Comparison 0 Mode Update Register
@{*/


#define PWM0_PWM_CMP[6]_PWM_CMPMUPD_CUPRUPD_SHIFT		16
#define PWM0_PWM_CMP[6]_PWM_CMPMUPD_CUPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[6]_pwm_cmpmupd_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM0_PWM_CMP[6]_PWM_CMPMUPD_CPRUPD_SHIFT		8
#define PWM0_PWM_CMP[6]_PWM_CMPMUPD_CPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[6]_pwm_cmpmupd_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM0_PWM_CMP[6]_PWM_CMPMUPD_CTRUPD_SHIFT		4
#define PWM0_PWM_CMP[6]_PWM_CMPMUPD_CTRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[6]_pwm_cmpmupd_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM0_PWM_CMP[6]_PWM_CMPMUPD_CENUPD Comparison x Enable Update **/
#define PWM0_PWM_CMP[6]_PWM_CMPMUPD_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpv PWMCMP[7]PWMCMPV PWM Comparison 0 Value Register
@{*/

/** PWM0_PWM_CMP[7]_PWM_CMPV_CVM Comparison x Value Mode **/
#define PWM0_PWM_CMP[7]_PWM_CMPV_CVM		(1 << 24)

#define PWM0_PWM_CMP[7]_PWM_CMPV_CV_SHIFT		0
#define PWM0_PWM_CMP[7]_PWM_CMPV_CV_MASK		0xffffff
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpv_cv CV Comparison x Value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpvupd PWMCMP[7]PWMCMPVUPD PWM Comparison 0 Value Update Register
@{*/

/** PWM0_PWM_CMP[7]_PWM_CMPVUPD_CVMUPD Comparison x Value Mode Update **/
#define PWM0_PWM_CMP[7]_PWM_CMPVUPD_CVMUPD		(1 << 24)

#define PWM0_PWM_CMP[7]_PWM_CMPVUPD_CVUPD_SHIFT		0
#define PWM0_PWM_CMP[7]_PWM_CMPVUPD_CVUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpvupd_cvupd CVUPD Comparison x Value Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpm PWMCMP[7]PWMCMPM PWM Comparison 0 Mode Register
@{*/


#define PWM0_PWM_CMP[7]_PWM_CMPM_CUPRCNT_SHIFT		20
#define PWM0_PWM_CMP[7]_PWM_CMPM_CUPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpm_cuprcnt CUPRCNT Comparison x Update Period Counter
@{*/
/**@}*/


#define PWM0_PWM_CMP[7]_PWM_CMPM_CUPR_SHIFT		16
#define PWM0_PWM_CMP[7]_PWM_CMPM_CUPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpm_cupr CUPR Comparison x Update Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[7]_PWM_CMPM_CPRCNT_SHIFT		12
#define PWM0_PWM_CMP[7]_PWM_CMPM_CPRCNT_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpm_cprcnt CPRCNT Comparison x Period Counter
@{*/
/**@}*/


#define PWM0_PWM_CMP[7]_PWM_CMPM_CPR_SHIFT		8
#define PWM0_PWM_CMP[7]_PWM_CMPM_CPR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpm_cpr CPR Comparison x Period
@{*/
/**@}*/


#define PWM0_PWM_CMP[7]_PWM_CMPM_CTR_SHIFT		4
#define PWM0_PWM_CMP[7]_PWM_CMPM_CTR_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpm_ctr CTR Comparison x Trigger
@{*/
/**@}*/

/** PWM0_PWM_CMP[7]_PWM_CMPM_CEN Comparison x Enable **/
#define PWM0_PWM_CMP[7]_PWM_CMPM_CEN		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpmupd PWMCMP[7]PWMCMPMUPD PWM Comparison 0 Mode Update Register
@{*/


#define PWM0_PWM_CMP[7]_PWM_CMPMUPD_CUPRUPD_SHIFT		16
#define PWM0_PWM_CMP[7]_PWM_CMPMUPD_CUPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpmupd_cuprupd CUPRUPD Comparison x Update Period Update
@{*/
/**@}*/


#define PWM0_PWM_CMP[7]_PWM_CMPMUPD_CPRUPD_SHIFT		8
#define PWM0_PWM_CMP[7]_PWM_CMPMUPD_CPRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpmupd_cprupd CPRUPD Comparison x Period Update
@{*/
/**@}*/


#define PWM0_PWM_CMP[7]_PWM_CMPMUPD_CTRUPD_SHIFT		4
#define PWM0_PWM_CMP[7]_PWM_CMPMUPD_CTRUPD_MASK		0x0f
/** @defgroup pwm0_pwm_cmp[7]_pwm_cmpmupd_ctrupd CTRUPD Comparison x Trigger Update
@{*/
/**@}*/

/** PWM0_PWM_CMP[7]_PWM_CMPMUPD_CENUPD Comparison x Enable Update **/
#define PWM0_PWM_CMP[7]_PWM_CMPMUPD_CENUPD		(1 << 0)

/**@}*/

/** @defgroup pwm0_pwm_ch_num[0]_pwm_cmr PWMCHNUM[0]PWMCMR PWM Channel Mode Register (ch_num = 0)
@{*/

/** PWM0_PWM_CH_NUM[0]_PWM_CMR_PPM Push-Pull Mode **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_PPM		(1 << 19)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_DTLI Dead-Time PWMLx Output Inverted **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_DTLI		(1 << 18)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_DTHI Dead-Time PWMHx Output Inverted **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_DTHI		(1 << 17)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_DTE Dead-Time Generator Enable **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_DTE		(1 << 16)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_TCTS Timer Counter Trigger Selection **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_TCTS		(1 << 13)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_DPOLI Disabled Polarity Inverted **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_DPOLI		(1 << 12)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_UPDS Update Selection **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_UPDS		(1 << 11)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_CES Counter Event Selection **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_CES		(1 << 10)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_CPOL Channel Polarity **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_CPOL		(1 << 9)
/** PWM0_PWM_CH_NUM[0]_PWM_CMR_CALG Channel Alignment **/
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_CALG		(1 << 8)

#define PWM0_PWM_CH_NUM[0]_PWM_CMR_CPRE_SHIFT		0
#define PWM0_PWM_CH_NUM[0]_PWM_CMR_CPRE_MASK		0x0f
/** @defgroup pwm0_pwm_ch_num[0]_pwm_cmr_cpre CPRE Channel Pre-scaler
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[0]_pwm_cdty PWMCHNUM[0]PWMCDTY PWM Channel Duty Cycle Register (ch_num = 0)
@{*/


#define PWM0_PWM_CH_NUM[0]_PWM_CDTY_CDTY_SHIFT		0
#define PWM0_PWM_CH_NUM[0]_PWM_CDTY_CDTY_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[0]_pwm_cdty_cdty CDTY Channel Duty-Cycle
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[0]_pwm_cdtyupd PWMCHNUM[0]PWMCDTYUPD PWM Channel Duty Cycle Update Register (ch_num = 0)
@{*/


#define PWM0_PWM_CH_NUM[0]_PWM_CDTYUPD_CDTYUPD_SHIFT		0
#define PWM0_PWM_CH_NUM[0]_PWM_CDTYUPD_CDTYUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[0]_pwm_cdtyupd_cdtyupd CDTYUPD Channel Duty-Cycle Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[0]_pwm_cprd PWMCHNUM[0]PWMCPRD PWM Channel Period Register (ch_num = 0)
@{*/


#define PWM0_PWM_CH_NUM[0]_PWM_CPRD_CPRD_SHIFT		0
#define PWM0_PWM_CH_NUM[0]_PWM_CPRD_CPRD_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[0]_pwm_cprd_cprd CPRD Channel Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[0]_pwm_cprdupd PWMCHNUM[0]PWMCPRDUPD PWM Channel Period Update Register (ch_num = 0)
@{*/


#define PWM0_PWM_CH_NUM[0]_PWM_CPRDUPD_CPRDUPD_SHIFT		0
#define PWM0_PWM_CH_NUM[0]_PWM_CPRDUPD_CPRDUPD_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[0]_pwm_cprdupd_cprdupd CPRDUPD Channel Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[0]_pwm_ccnt PWMCHNUM[0]PWMCCNT PWM Channel Counter Register (ch_num = 0)
@{*/


#define PWM0_PWM_CH_NUM[0]_PWM_CCNT_CNT_SHIFT		0
#define PWM0_PWM_CH_NUM[0]_PWM_CCNT_CNT_MASK		0xffffff
/** @defgroup pwm0_pwm_ch_num[0]_pwm_ccnt_cnt CNT Channel Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm0_pwm_ch_num[0]_pwm_dt PWMCHNUM[0]PWMDT PWM Channel Dead Time Register (ch_num = 0)
@{*/


#define PWM0_PWM_CH_NUM[0]_PWM_DT_DTL_SHIFT		16
#define PWM0_PWM_CH_NUM[0]_PWM_DT_DTL_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[0]_pwm_dt_dtl DTL Dead-Time Value for PWMLx Output
@{*/
/**@}*/


#define PWM0_PWM_CH_NUM[0]_PWM_DT_DTH_SHIFT		0
#define PWM0_PWM_CH_NUM[0]_PWM_DT_DTH_MASK		0xffff
/** @defgroup pwm0_pwm_ch_num[0]_pwm_dt_dth DTH Dead-Time Value for PWMHx Output
@{*/
/**@}*/


/**@}*/

